# ETL (Extract Transform Load)  Project
### Week 15 - January 12, 2022
##### Angela Spencer - Clarine Esperance - Ayesha Patel

In [32]:
#Dependencies
import pandas as pd
import numpy as np
import requests
import json
import random
import warnings
warnings.filterwarnings('ignore')

#imports for ETL
import psycopg2
from password import password 
from sqlalchemy import create_engine
from sqlalchemy import inspect

## Extracting Data
- For this project, our primary data source was the Web API, http://audiodb.com which uses JSON data and contains information on over 53,000 artists. 
- We also created a csv from standard 2 character country codes, this was imported, and used to decode the country codes extracted from the web API into expanded country names.


#### Generate Dictionary of Artist Data from Web API
- In order to pull a managable amount of data, we created a list of randomly generated numbers within the range of available artist IDs. 
- This list was used to loop through the database URLs and pull information on all available artist IDs in the list. 
- From this information we created a new list with artist names corresponding to the aritst IDs. 
- With the new list of artist names we were able to loop through database URLs to populate a dictionary with data, including: 
        - artist ID
        - artist name
        - gender
        - number of members
        - music style/genre
        - year formed
        - year disbanded
        - country
        - location

In [33]:
# Find a code to get all the artists from this api
# https://www.theaudiodb.com/api_guide.php

# empty list to be populated with artist info
artist_names = []

audio_data = {'artist_id':[],
               'artist_name':[],
               'gender':[],
               'member_count':[],
               'style':[], 
               'genre':[],
               'year_formed':[],
               'year_disbanded':[],
               'country_code':[],
               'label':[]}

In [34]:
#generate random numbers in the range of available artist IDs
#used to populate artist_names list
#set random seed
random.seed(66)
random_nums = [random.randint(100000, 170000) for i in range(1500)]

#test with known IDs and intentional errors
#random_nums = [112024, 0, 100000, 114364]

In [35]:
#this artist list uses a random number generator to test the database for artist IDs
#if an ID corresponds to an artist, it append the artist's information to info lists
#create a base url
#example: https://theaudiodb.com/api/v1/json/2/artist.php?i=112024
id_url = "https://theaudiodb.com/api/v1/json/2/artist.php?i="

#create a loop that uses random numbers list
for num in random_nums:
    unique_url = id_url + f'{num}'
    
    #call api url
    request = requests.get(unique_url)
    
    #for each attempt try to convert information to json
    try:
        #convert to json
        info = request.json()
        
    #exception json decode error
    #https://docs.python.org/3/tutorial/controlflow.html
    except json.JSONDecodeError:
        #end this iteration and continue new iteration of for loop
        continue
    #if json conversion successful then
    #try to create a variable for single artist to reference later
    try:
        artist = info['artists'][0]['strArtist']
        
    #TypeError exception if url responds with {'artists': None}
    except (TypeError):
        continue
        
    #if the artist is not already in the list then 
    if artist not in artist_names:
        
        #populate artist_names list using info(json)
        #response-> {'artists': [{'idArtist': '114364', 'strArtist': 'Beyoncé', ...
        #dictionary{'artists':['{dictionary}']}
        audio_data['artist_id'].append(info['artists'][0]['idArtist'])
        audio_data['artist_name'].append(info['artists'][0]['strArtist'])
        audio_data['gender'].append(info['artists'][0]["strGender"])
        audio_data['member_count'].append(info['artists'][0]["intMembers"])
        audio_data['style'].append(info['artists'][0]["strStyle"])
        audio_data['genre'].append(info['artists'][0]["strGenre"])
        audio_data['year_formed'].append(info['artists'][0]["intFormedYear"])
        audio_data['year_disbanded'].append(info['artists'][0]["strDisbanded"])
        audio_data['country_code'].append(info['artists'][0]['strCountryCode'])
        audio_data['label'].append(info['artists'][0]['strLabel'])

In [36]:
#import csv containing standard 2 digit alpha codes for countries
countries_df = pd.read_csv('alpha2_codes.csv')
countries_df

       country_name country_code
0       Afghanistan          AF
1           Albania          AL
2           Algeria          DZ
3    American Samoa          AS
4           Andorra          AD
..              ...          ...
245           Yemen           YE
246          Zambia           ZM
247        Zimbabwe           ZW
248   Aland Islands           AX
249            None         None

[250 rows x 2 columns]

## Transforming Data
- The Web API extracted data was transformed into a dataframe and preprocessed to streamline the data.
- Our preprocessing included converting null values for consistency, converting datatypes, and feature engineering.

- Missing values were not dropped from the dataframe because when they are dropped, it removes a lot of the data points. We also do not have enough information regarding the data to know if the missing values are intentional. For example, if and artists/artist group is missing information in the genre column, it may be that they are in multiple genre categories. Also, since this database is to be used by multiple people, we want to keep the data points so that the data can be used in ways others see fit

#### Convert audio_data Dictionary to DataFrame

In [37]:
audio_df = pd.DataFrame(audio_data)
audio_df

,artist_id,artist_name,gender,member_count,style,genre,year_formed,year_disbanded,country_code,label
0,140892,Ice Nine Kills,Male,4,,Metalcore,2006,None,US,None
1,132276,Savage,Male,1,Electronic,Synthpop,1983,None,IT,None
2,158416,Jason Hawk Harris,None,None,None,,0,None,,None
3,133565,Violent Work of Art,Mixed,4,,Industrial Metal,1994,None,SE,None
4,112476,James Horner,Male,1,Classical,OST,1979,None,US,None
...,...,...,...,...,...,...,...,...,...,...
1162,113477,Terror,Male,5,Rock/Pop,Hardcore,2000,None,US,None
1163,157114,DJ Baur,None,None,None,,0,None,,None
1164,114531,Toots & The Maytals,,1,Reggae,Reggae,1963,None,JM,None
1165,117428,Gendai Kano,Male,1,Classical,Musical,1938,None,JP,None
1166,160496,24kGoldn,Male,1,Urban/R&B,Hip-Hop,2016,None,US,Columbia

#### Converting to Null Values
- Cleaning the data to ensure that all null values are represented in the same way.  
- For string datatypes, all missing values (NaN, Null, None, and empty string) were replaced with 'None' to indicate that there is no available data.
- For numeric datatypes, all missing values were replaced with 0 to allow numeric filtering in postgres.

In [38]:
#sum of null values in each column
print(audio_df.isnull().sum())

#style has more null values than genre, drop style column
audio_df.drop(['style'], axis=1, inplace=True)

artist_id            0
artist_name          0
gender             350
member_count       350
style              356
genre               62
year_formed        153
year_disbanded    1097
country_code         0
label             1102
dtype: int64

In [39]:
#convert empty strings and null values to NaN
audio_df.replace({'0':'None',
                  0:'None', 
                  None:'None', 
                  '':'None',
                  np.nan:'None',
                  'NaN':'None'}, inplace = True)

In [40]:
audio_df.isnull().sum()

artist_id         0
artist_name       0
gender            0
member_count      0
genre             0
year_formed       0
year_disbanded    0
country_code      0
label             0
dtype: int64

#### Converting datatypes

- Checking the datatypes.
- Converting artist_id, member_count, year_formed, year_disbanded columns from object datatypes to numeric datatypes (floats or integer) using pd.to_numeric. Pandas.to_numeric is a function that converts arugments to numeric values.

In [41]:
audio_df.dtypes

artist_id         object
artist_name       object
gender            object
member_count      object
genre             object
year_formed       object
year_disbanded    object
country_code      object
label             object
dtype: object

In [42]:
#convert dtypes from string to numeric dtypes
audio_df[['artist_id', 
          'member_count', 
          'year_formed', 
          'year_disbanded']] = audio_df[['artist_id', 
                                         'member_count', 
                                         'year_formed', 
                                         'year_disbanded']].apply(pd.to_numeric,errors='coerce',downcast='integer')
#convert float to integer
audio_df[['artist_id', 
          'member_count', 
          'year_formed', 
          'year_disbanded']] = audio_df[['artist_id', 
                                         'member_count', 
                                         'year_formed', 
                                         'year_disbanded']].convert_dtypes(convert_integer=True, convert_string=False)
audio_df.dtypes

artist_id          Int32
artist_name       object
gender            object
member_count       Int64
genre             object
year_formed        Int64
year_disbanded     Int64
country_code      object
label             object
dtype: object

- Pd.to_datetime is used to convert the year_formed and year_disbanded columns. Nanoseconds that were included in the year_formed and year_disbanded were removed to just have the dates without the timestamp.

In [43]:
#convert year_disbanded and year_formed to datetime

pd.to_datetime(audio_df['year_formed'], 
               format= '%Y', errors='coerce')

0      2006-01-01
1      1983-01-01
2             NaT
3      1994-01-01
4      1979-01-01
          ...
1162   2000-01-01
1163          NaT
1164   1963-01-01
1165   1938-01-01
1166   2016-01-01
Name: year_formed, Length: 1167, dtype: datetime64[ns]

- During numeric conversion, null values were converted to NaN. These NaN values were converted to 0 to assist with the querying for postgres.

In [44]:
#convert NaN created by numeric conversion into 0 in order to query later
audio_df.replace({np.nan:0}, inplace = True)
audio_df

,artist_id,artist_name,gender,member_count,genre,year_formed,year_disbanded,country_code,label
0,140892,Ice Nine Kills,Male,4,Metalcore,2006,0,US,None
1,132276,Savage,Male,1,Synthpop,1983,0,IT,None
2,158416,Jason Hawk Harris,None,0,None,0,0,None,None
3,133565,Violent Work of Art,Mixed,4,Industrial Metal,1994,0,SE,None
4,112476,James Horner,Male,1,OST,1979,0,US,None
...,...,...,...,...,...,...,...,...,...
1162,113477,Terror,Male,5,Hardcore,2000,0,US,None
1163,157114,DJ Baur,None,0,None,0,0,None,None
1164,114531,Toots & The Maytals,None,1,Reggae,1963,0,JM,None
1165,117428,Gendai Kano,Male,1,Musical,1938,0,JP,None
1166,160496,24kGoldn,Male,1,Hip-Hop,2016,0,US,Columbia

#### Feature Engineering
- Created a new colum of expanded country names corresponding to country codes. 
- The dataframe of alpha2 country codes was used to create this column.
- Countries_df was merged into the audio_df using the function pd.merge.

In [45]:
audio_df['country_code'].value_counts()

US      291
None    221
GB      111
DE       65
FR       61
       ...
MY        1
CO        1
GH        1
IR        1
SW        1
Name: country_code, Length: 72, dtype: int64

In [46]:
#merge list of country codes onto audio_df to create new column of country names
audio_df = pd.merge(audio_df, countries_df)
audio_df

,artist_id,artist_name,gender,member_count,genre,year_formed,year_disbanded,country_code,label,country_name
0,140892,Ice Nine Kills,Male,4,Metalcore,2006,0,US,None,United States of America (the)
1,112476,James Horner,Male,1,OST,1979,0,US,None,United States of America (the)
2,160023,Mickey Petralia,Male,1,None,0,0,US,None,United States of America (the)
3,169251,3D Natee,Female,1,Rap,0,0,US,None,United States of America (the)
4,150340,Dick Schory's New Percussion Ensemble,Male,1,Acoustic,1958,0,US,None,United States of America (the)
...,...,...,...,...,...,...,...,...,...,...
1095,130853,İlhan Erşahin,None,1,None,1965,0,TR,None,Turkey
1096,167192,Veronika Povilioniene,Female,1,Folk,1987,0,LT,None,Lithuania
1097,149602,李雲迪,Male,1,Pianist,0,0,CN,None,China
1098,167328,ريم بنا,Female,1,World/Ethnic,0,0,PS,None,"Palestine, State of"
1099,155862,Ana Vidović,Female,1,Instrumental,0,0,HR,None,Croatia

#### Drop duplicate artist_ids and country_codes

- Ensuring that artists_id and countries are not duplicated in the dataframe. 
- These columns were used later as Primary Keys in Postgres and so must be composed of unique values and contain no null values.
- After duplicates were dropped, the index of the dataframe was reset.

In [47]:
#drop 5 duplicate artist_ids that were discovered
audio_df.drop_duplicates(subset=['artist_id'], inplace=True)
audio_df.reset_index(inplace=True, drop=True)

In [48]:
# countries_df contains only unique values
# drop two codes that contained null values
countries_df.drop([249, 152], inplace=True)
countries_df.reset_index(inplace = True, drop=True)

### Creating Tables

- The dataframe audio_df (containing all data) was used to create two tables in postgres, corresponding to two dataframes:
    - artist_df
    - artist_info_df
- The third table was created from the csv of alpha2 country codes, renamed here as:
    - location_info_df

In [49]:
# split data into multiple data frames for tables
artist_df = audio_df.iloc[:,:4]
artist_df

      artist_id                            artist_name  gender  member_count
0        140892                         Ice Nine Kills    Male             4
1        112476                           James Horner    Male             1
2        160023                        Mickey Petralia    Male             1
3        169251                               3D Natee  Female             1
4        150340  Dick Schory's New Percussion Ensemble    Male             1
...         ...                                    ...     ...           ...
1090     130853                          İlhan Erşahin    None             1
1091     167192                  Veronika Povilioniene  Female             1
1092     149602                                    李雲迪    Male             1
1093     167328                                ريم بنا  Female             1
1094     155862                            Ana Vidović  Female             1

[1095 rows x 4 columns]

In [50]:
artist_info_df = audio_df.iloc[:, [0,7,4,5,6,8]]
artist_info_df

      artist_id country_code         genre  year_formed  year_disbanded label
0        140892           US     Metalcore         2006               0  None
1        112476           US           OST         1979               0  None
2        160023           US          None            0               0  None
3        169251           US           Rap            0               0  None
4        150340           US      Acoustic         1958               0  None
...         ...          ...           ...          ...             ...   ...
1090     130853           TR          None         1965               0  None
1091     167192           LT          Folk         1987               0  None
1092     149602           CN       Pianist            0               0  None
1093     167328           PS  World/Ethnic            0               0  None
1094     155862           HR  Instrumental            0               0  None

[1095 rows x 6 columns]

In [51]:
#use countries_df created from csv to create df for table
location_info_df = countries_df
location_info_df

       country_name country_code
0       Afghanistan          AF
1           Albania          AL
2           Algeria          DZ
3    American Samoa          AS
4           Andorra          AD
..              ...          ...
243  Western Sahara           EH
244           Yemen           YE
245          Zambia           ZM
246        Zimbabwe           ZW
247   Aland Islands           AX

[248 rows x 2 columns]

## Loading Data to PostgreSQL

#### SQLalchemy and Psycopg2:
- SQLAlchemy generates SQL statements and psycopg2 sends SQL statements to the database. 
- SQLAlchemy depends on psycopg2 or other database drivers to communicate with the database
- SQLalchemy has two components: object-relational mapper(ORM) and Core
- The Core is itself a fully featured SQL abstraction toolkit 
    - provides a smooth layer of abstraction over a wide variety of DBAPI implementations and behaviors, 
    - provides SQL Expression Language which allows expression of the SQL language through Python expressions.

#### Out Method:
- A connection to PostgreSQL was created using Psycopg2 and SQLalchemy. 
- To form this connection and create the sql tables, a function was created called create_table, which takes in a dataframe and a table name 
    - connection is formed to Postgres through psycopg2.connect(), specifying Postgres connection arguments
    - communication is established through SQLalchemy.create_engine() which specifies database dialect and Postgres connection arguments
    - SQLalchemy.to_sql() function is used to convert the dataframe to a table in postgres
- Two dataframes were then converted to sql tables: 
        - audio_df
        - location_info_df

In [52]:
# define a function that will take in a dataframe and a table_name 
# function connect tp postgres through psycopg2, creates a sqlalchemy engine
# and uses the parameters to create a table in the audio_data database
# using the to_sql function

def create_table(df, table_name):
    try:
        #connect to postgres through psycopg2
        conn = psycopg2.connect(host="localhost", 
                                dbname="audio_data", 
                                user="postgres", 
                                password=password)
        
        #create an engine to communicate with postgres
        postgres_str = f'postgresql+psycopg2://postgres:'+password+'@localhost:5432/audio_data'
        engine = create_engine(postgres_str)

        #use the to_sql function to create a table 
        df.to_sql(table_name, con=engine, index=False, if_exists='replace')
        
        #verify that table was created
        return engine.table_names()
        
    # raise errors in connection or function
    except Exception as error:
        print(error)
    
    #close connection and engine if success or error
    finally:
        conn.close()
        engine.dispose

In [53]:
#call function to create table containing all data
create_table(audio_df, 'audio')
#call function to create table containing country code and country name information
create_table(location_df, 'location_info')

['audio', 'location_info']

### Execute DDL commands

- DDL (Database Definition Language) is code that creates tables and defines their constraints. 
- The code below is a list of DDL used to create and/or alter the tables. Tables will be created if it does not exist; if the table does exist, the code will not be executed. Specifically, the audio and location table will be altered since they already exist. 
- Created tables were generated from the audio table (created from audio_df) in the function above 
        - artist
        - artist_info
- Existing table: 
        - location_info_df

In [61]:
DDL_queries = [
    #audio table DDL
    "ALTER TABLE audio ALTER COLUMN artist_id TYPE integer USING artist_id::integer;",
    "ALTER TABLE audio ALTER COLUMN year_formed TYPE integer USING year_formed::integer;",
    "ALTER TABLE audio ALTER COLUMN artist_id SET NOT NULL;",
    
    #location_info table DDL
    "ALTER TABLE location_info ALTER COLUMN country_code SET NOT NULL;",
    "ALTER TABLE location_info DROP CONSTRAINT IF EXISTS location_info_pkey;",
    "ALTER TABLE location_info ADD PRIMARY KEY (country_code);",
    
    #artist table DDL
    "CREATE TABLE IF NOT EXISTS artist AS SELECT artist_id, artist_name, gender, member_count FROM audio;",
    "ALTER TABLE artist ALTER COLUMN member_count TYPE integer USING member_count::integer;",
    "ALTER TABLE artist DROP CONSTRAINT IF EXISTS artist_pkey;",
    "ALTER TABLE artist ADD PRIMARY KEY (artist_id);",

    #artist_info table DDL
    "CREATE TABLE IF NOT EXISTS artist_info AS SELECT artist_id, country_code, genre, year_formed, year_disbanded, label FROM audio;",
    "ALTER TABLE artist_info DROP CONSTRAINT IF EXISTS artist_info_pkey;",
    "ALTER TABLE artist_info ADD PRIMARY KEY (artist_id);",

    #drop redundant audio table
    "DROP TABLE IF EXISTS audio;"
   ]

- A for loop is inserted inside the function that connects to postgres through psycopg2 with the necessary parameters (host, dbname, user, password). 
- The for loop takes in the DDL_queries list to create and alter the tables. 
- Try and except has been added to print an error if a table cannot be executed. 
- The finally block has been added to close the connection, cursor, and engine wether or not the loop is successful.

In [62]:
cur = None
conn = None

#connect to postgres through psycopg2
try:
    conn = psycopg2.connect(host="localhost", 
                            dbname="audio_data", 
                            user="postgres", 
                            password=password)

    #create cursor to give commands to postgres
    cur = conn.cursor()
    
    #create a loop to execute each DDL 
    for query in DDL_queries:
        
        #execute each query in DDL_queries list
        cur.execute(query)
        
        #string explanation 
        print('execute '+query)
        
    
    conn.commit()
    print('queries committed')
    
# raise errors in connection or function
except Exception as error:
    print(error)

#close cursor, connection and engine if success or error
finally:
    if cur is not None:
        cur.close()
        print('cursor closed')
    if conn is not None:
        conn.close()
        print('connection closed')

execute ALTER TABLE audio ALTER COLUMN artist_id TYPE integer USING artist_id::integer;
execute ALTER TABLE audio ALTER COLUMN year_formed TYPE integer USING year_formed::integer;
execute ALTER TABLE audio ALTER COLUMN artist_id SET NOT NULL;
execute ALTER TABLE location_info ALTER COLUMN country_code SET NOT NULL;
execute ALTER TABLE location_info DROP CONSTRAINT IF EXISTS location_info_pkey;
execute ALTER TABLE location_info ADD PRIMARY KEY (country_code);
execute CREATE TABLE IF NOT EXISTS artist AS SELECT artist_id, artist_name, gender, member_count FROM audio;
execute ALTER TABLE artist ALTER COLUMN member_count TYPE integer USING member_count::integer;
execute ALTER TABLE artist DROP CONSTRAINT IF EXISTS artist_pkey;
execute ALTER TABLE artist ADD PRIMARY KEY (artist_id);
execute CREATE TABLE IF NOT EXISTS artist_info AS SELECT artist_id, country_code, genre, year_formed, year_disbanded, label FROM audio;
execute ALTER TABLE artist_info DROP CONSTRAINT IF EXISTS artist_info_pkey;
execute ALTER TABLE artist_info ADD PRIMARY KEY (artist_id);
execute DROP TABLE IF EXISTS audio;
queries committed
cursor closed
connection closed

### Execute DML Queries
- DML (Database Manipulation Language) is code that is used to add, retrieve, or update data within a database.
- Here, the queries were run individually in order to discuss the results. Queries consist of strings within variables that are fed to the psycopg2 executed by the cursor.
- Where there is a neccessary output, we choose to fetch the results through the cur.fetchall() command. This is followed by the creation and display of the dataframe.
- Finally, after all queries are complete, the connection and cursor are closed.

In [83]:
#establish connection through psycopg2
conn = psycopg2.connect(host="localhost", 
                        dbname="audio_data", 
                        user="postgres", 
                        password=password)

#create cursor to give commands to postgres
cur = conn.cursor()

#### Query 1: Which genres are most popular by country name?

##### Results -

In [84]:
query1 = "SELECT country_name, genre, COUNT(genre) AS genre_count FROM location_info INNER JOIN artist_info ON location_info.country_code = artist_info.country_code GROUP BY genre, country_name ORDER BY genre_count DESC;"

In [85]:
#execute each query in DDL_queries list
cur.execute(query1)

#fetch results and store in results variable
results_query1 = cur.fetchall()

#create and display data frame
query1_df = pd.DataFrame(results_query1, columns = ['country_name', 'genre', 'genre_count'])
display(query1_df)

,country_name,genre,genre_count
0,United States of America (the),None,110
1,United Kingdom of Great Britain and Northern I...,None,32
2,Germany,None,26
3,France,None,20
4,United States of America (the),Jazz,20
...,...,...,...
356,Sweden,Classic Rock,1
357,Denmark,Electronic,1
358,United Kingdom of Great Britain and Northern I...,Ambient,1
359,Norway,Electronic,1
360,Viet Nam,None,1

#### Query 2: On average how many bands (> 1 member) were formed from 2009-2019? How many were formed in 2020?


##### Results -

In [86]:
query2a = "SELECT COUNT(artist_info.year_formed) AS year_count INTO newtable FROM artist_info LEFT JOIN artist ON artist_info.artist_id = artist.artist_id WHERE artist.member_count > 1  AND artist_info.year_formed BETWEEN 2009 AND 2019 GROUP BY artist_info.year_formed;"
query2b = "SELECT ROUND(AVG(year_count), 2) FROM newtable;"
query2c = "SELECT COUNT(artist_info.year_formed) AS count_2020 FROM artist_info LEFT JOIN artist ON artist_info.artist_id = artist.artist_id WHERE artist.member_count > 1 AND artist_info.year_formed = 2020;"
query2d = "DROP TABLE IF EXISTS newtable;"

**AVERAGE NUMBER OF BANDS FORMED PER YEAR FROM 2009-2019 -- ABOUT 4 BANDS PER YEAR**

In [87]:
#execute query and store fetched results
cur.execute(query2a)
#results_query2a = cur.fetchall()

#create and display data frame
#query2a_df = pd.DataFrame(results_query2a, columns = ['year_count'])
#display(query2a_df)

#execute query and store fetched results
cur.execute(query2b)
results_query2b = cur.fetchall()

#create and display data frame results
query2b_df = pd.DataFrame(results_query2b, columns = ['year_count'])
display(query2b_df)

  year_count
0       3.80

**NUMBER OF BANDS FORMED IN 2020 -- 2 BANDS**

In [89]:
#execute query and store fetched results
cur.execute(query2c)
results_query2c = cur.fetchall()

#execute query to drop manufactured table
cur.execute(query2d)
#results_query2d = cur.fetchall()

#create and display data frame results
query2c_df = pd.DataFrame(results_query2c, columns = ['count_2020'])
display(query2c_df)

   count_2020
0           2

#### Query 3: Which artists were formed in the 90s (1990-1999)?


##### Results -

In [90]:
query3 = "SELECT DISTINCT artist_name, year_formed FROM artist INNER JOIN artist_info ON artist.artist_id = artist_info.artist_id WHERE year_formed BETWEEN 1990 AND 1999 ORDER BY year_formed DESC;"

In [91]:
#execute query
cur.execute(query3)

#fetch results and store in results variable
results_query3 = cur.fetchall()

#create and display data frame
query3_df = pd.DataFrame(results_query3, columns = ['artist_name', 'year_formed'])
display(query3_df)

                   artist_name  year_formed
0                        BAZRA         1999
1                     D-Ground         1999
2                  Damien Saez         1999
3                    El Chojin         1999
4                  Grafvolluth         1999
..                         ...          ...
141                Ai Ninomiya         1990
142                       O.C.         1990
143          Sálvate si puedes         1990
144  The Lord Weird Slough Feg         1990
145           The Three Tenors         1990

[146 rows x 2 columns]

#### Query 4 answers: How many artist names begin with the letter B and were formed in 2000?


##### Results -

In [92]:
query4 = "SELECT artist_name, year_formed FROM artist INNER JOIN artist_info ON artist.artist_id = artist_info.artist_id WHERE artist_name LIKE 'B%' AND year_formed = '2000';"

In [93]:
#execute query
cur.execute(query4)

#fetch results and store in results variable
results_query4 = cur.fetchall()

#create and display data frame
query4_df = pd.DataFrame(results_query4, columns = ['artist_name_B', 'year_formed'])
display(query4_df)

     artist_name_B  year_formed
0  Blitzen Trapper         2000
1         Belanova         2000

#### Query 5: What are the top three popular genres among artists?


##### Results -

In [94]:
query5 = "SELECT genre, COUNT(*) AS amount FROM artist_info GROUP BY genre ORDER BY amount DESC LIMIT 4;"

In [95]:
#execute query
cur.execute(query5)

#fetch results and store in results variable
results_query5 = cur.fetchall()

#create and display data frame
query5_df = pd.DataFrame(results_query5, columns = ['genre', 'amount'])
display(query5_df)

  genre  amount
0  None     501
1   Pop      46
2  Jazz      40
3  Rock      28

#### Query 6: Which artists were formed in the year 2000?


##### Results -

In [96]:
query6= "SELECT artist_name, li.country_code, year_formed FROM artist AS ar INNER JOIN artist_info AS ai ON ar.artist_id = ai.artist_id INNER JOIN location_info AS li ON ai.country_code = li.country_code WHERE year_formed = 2000 AND li.country_code = 'US';"

In [97]:
#execute query
cur.execute(query6)

#fetch results and store in results variable
results_query6 = cur.fetchall()

#create and display data frame
query6_df = pd.DataFrame(results_query6, columns = ['artists', 'country', 'year formed'])
display(query6_df)

conn.close()
cur.close()

              artists country  year formed
0     Blitzen Trapper      US         2000
1  The Fiery Furnaces      US         2000
2             Ms. Toi      US         2000
3              Terror      US         2000

## Summary
There are some limitations with this dataset, primarily a large amount of missing data, a skew towards artists that are based in the United States and Western Europe, and the crow-sources nature of artists that are entered into the database. However, this method worked well for extracting and transforming data in Python and loading it into PostgreSQL using Psycopg2 and SQLalchemy. We were able to ask questions in the form of SQL queries and produce results from the database. This technique could be used for further preprocessing and statistical analysis of datasets.

## Resources

- Lucid Chart Database Relationships: 
    - https://lucid.app/lucidchart/b66c2a87-fe8f-47d8-bda5-2b956cbef198/edit?invitationId=inv_02b09703-d336-4f85-974e-7362d9f30bf9&page=0_0#

- Psycopg2: 
    - https://www.postgresqltutorial.com/postgresql-python/transaction/ 
    - https://pynative.com/python-postgresql-tutorial/
    - https://www.psycopg.org/docs/usage.html#passing-parameters-to-sql-queries 
    - https://www.youtube.com/watch?v=M2NzvnfS-hI&t=846s https://pynative.com/python-postgresql-insert-update-delete-table-data-to-perform-crud-operations/

- Insert line by line: 
    - https://pastebin.com/R8GWCnvm 
    - https://www.dataquest.io/blog/loading-data-into-postgres/

- SQLalchemy: 
    - https://stackoverflow.com/questions/9353822/connecting-postgresql-with-sqlalchemy
    - https://docs.sqlalchemy.org/en/14/core/engines.html#postgresql

- SQLalchemy writing dataframe to table: 
    - https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_sql.html
    - https://stackoverflow.com/questions/23103962/how-to-write-dataframe-to-postgres-table
    - https://www.py4u.net/discuss/181797

- DDL: 
    - https://www.techopedia.com/definition/1175/data-definition-language-ddl